let number = -5; // ← здесь можно поменять значение

if (number < 0) {
    console.log("Число отрицательное");
} else {
    console.log("Число неотрицательное");
}

let str = "Пример строки"; // ← здесь можно поменять значение

console.log("Длина строки:", str.length);

let str1 = "Пример строки"; // ← здесь можно поменять значение

console.log("Последний символ:", str[str.length - 1]);

let number21 = 10; // ← здесь можно поменять значение

if (number % 2 === 0) {
    console.log("Число четное");
} else {
    console.log("Число нечетное");
}

let word1 = "Привет"; // ← здесь можно поменять значение
let word2 = "Пока";    // ← здесь можно поменять значение

if (word1[0] === word2[0]) {
    console.log("Первые буквы совпадают");
} else {
    console.log("Первые буквы не совпадают");
}

